Repository: Negative-Star-Innovators/AgentRedactor
Catalog: windows/Strings/*/Resources.resw
Source language: en
Languages: af, ar, da, de, el, et, fi, fr, hi, hu, hy, ig_ng, is, ka, lv, ms, pl, ru, sl, sr_latn, sw, th, tr, ur, zh_cn

# Dialog_EnableSensitiveInfo_Message
source: This will write unredacted sensitive values (names, emails, phone numbers, etc.) and your API key to your log file on disk. Do not enable this if others have access to this computer. The setting resets when you close the app.
ar: سيؤدي هذا إلى كتابة قيم حساسة غير منقحة (الأسماء ورسائل البريد الإلكتروني وأرقام الهواتف وما إلى ذلك) ومفتاح واجهة برمجة التطبيقات (API) الخاص بك إلى ملف السجل الخاص بك على القرص. لا تقم بتمكين هذا إذا كان لدى الآخرين حق الوصول إلى هذا الكمبيوتر. تتم إعادة ضبط الإعداد عند إغلاق التطبيق.
hu: Ez a módosítatlan bizalmas értékeket (nevek, e-mailek, telefonszámok stb.) és az API-kulcsot a lemezen lévő naplófájlba írja. Ne engedélyezze ezt, ha mások is hozzáférhetnek ehhez a számítógéphez. A beállítás visszaáll az alkalmazás bezárásakor.
is: Þetta mun skrifa óbreytt viðkvæm gildi (nöfn, tölvupóstur, símanúmer o.s.frv.) og API lykilinn þinn í notendaskrána þína á disknum. Ekki virkja þetta ef aðrir hafa aðgang að þessari tölvu. Stillingin endurstillast þegar þú lokar appinu.
ka: ეს ჩაწერს არარედაქტირებულ მგრძნობიარე მნიშვნელობებს (სახელები, ელფოსტა, ტელეფონის ნომრები და ა.შ.) და თქვენს API გასაღებს თქვენს ჟურნალის ფაილზე დისკზე. არ ჩართოთ ეს, თუ სხვებს აქვთ წვდომა ამ კომპიუტერზე. პარამეტრი აღდგება აპის დახურვისას.
ms: Ini akan menulis nilai sensitif yang tidak disunting (nama, e-mel, nombor telefon, dll.) dan kunci API anda pada fail log anda pada cakera. Jangan dayakan ini jika orang lain mempunyai akses kepada komputer ini. Tetapan ditetapkan semula apabila anda menutup apl.
pl: Spowoduje to zapisanie niezredagowanych poufnych wartości (imion i nazwisk, adresów e-mail, numerów telefonów itp.) oraz klucza API w pliku dziennika na dysku. Nie włączaj tej opcji, jeśli inni mają dostęp do tego komputera. Ustawienie zostanie zresetowane po zamknięciu aplikacji.
ru: При этом неотредактированные конфиденциальные значения (имена, адреса электронной почты, номера телефонов и т. д.) и ваш ключ API будут записаны в файл журнала на диске. Не включайте это, если у других есть доступ к этому компьютеру. Настройка сбрасывается при закрытии приложения.
sr_latn: Ovo će zapisati neredigovane osetljive vrednosti (imena, e-poruke, brojevi telefona, itd.) i vaš API ključ u vašu datoteku evidencije na disku. Ne omogućavajte ovo ako drugi imaju pristup ovom računaru. Postavka se resetuje kada zatvorite aplikaciju.
